7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_RTC.h
#define  _RTC_TAMPCR_TAMP1NOERASE                            (0x1 << 17)    // Tamper 1 no erase
#define  _RTC_TAMPCR_TAMP1MF                                 (0x1 << 18)    // Tamper 1 mask flag
#define  _RTC_TAMPCR_TAMP2IE                                 (0x1 << 19)    // Tamper 2 interrupt enable
#define  _RTC_TAMPCR_TAMP2NOERASE                            (0x1 << 20)    // Tamper 2 no erase
#define  _RTC_TAMPCR_TAMP2MF                                 (0x1 << 21)    // Tamper 2 mask flag
#define  _RTC_TAMPCR_TAMP3IE                                 (0x1 << 22)    // Tamper 3 interrupt enable
#define  _RTC_TAMPCR_TAMP3NOERASE                            (0x1 << 23)    // Tamper 3 no erase
#define  _RTC_TAMPCR_TAMP3MF                                 (0x1 << 24)    // Tamper 3 mask flag
#define  _RTC_ALRMASSR_MASKSS                                (0xf << 24)    // Mask the most-significant bits starting at this bit
#define  _RTC_ALRMASSR_SS                                    (0x7fff << 0)    // Sub seconds value
#define  _RTC_ALRMBSSR_MASKSS                                (0xf << 24)    // Mask the most-significant bits starting at this bit
#define  _RTC_ALRMBSSR_SS                                    (0x7fff << 0)    // Sub seconds value
#define  _RTC_OR_RTC_ALARM_TYPE                              (0x1 << 0)    // RTC_ALARM on PC13 output type
#define  _RTC_OR_RTC_OUT_RMP                                 (0x1 << 1)    // RTC_OUT remap
#define  _RTC_BKP0R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP1R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP2R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP3R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP4R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP5R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP6R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP7R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP8R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP9R_BKP                                      (0xffffffff << 0)    // BKP
#define  _RTC_BKP10R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP11R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP12R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP13R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP14R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP15R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP16R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP17R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP18R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP19R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP20R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP21R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP22R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP23R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP24R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP25R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP26R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP27R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP28R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP29R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP30R_BKP                                     (0xffffffff << 0)    // BKP
#define  _RTC_BKP31R_BKP                                     (0xffffffff << 0)    // BKP
